DataProcessors/ПанельСофтФонУниверсальная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПанельСофтФонУниверсальная</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБ24</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПанельСофтФонУниверсальная/Forms/ФормаВыбораКонтакта/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборДляМессенджера") Тогда
		Элементы.ВыбратьКонтакт.Заголовок = "Отправить сообщение";
	Иначе
		Элементы.ВыбратьКонтакт.Заголовок = "Позвонить";
		Элементы.ВыбратьКонтакт.Картинка = БиблиотекаКартинок.Позвонить;
	КонецЕсли;
	
	ПолучитьНомераТелефонов(Параметры.СсылкаОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборКонтактаЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрСсылкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПоказатьЗначение(Новый ОписаниеОповещения("ПараметрСсылкаНажатиеЗавершение", ЭтаФорма), ПараметрСсылкаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрСсылкаНажатиеЗавершение(ДополнительныеПараметры) Экспорт
    // не удалять
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьКонтакт(Команда)
	
	ВыборКонтактаЗавершение();
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьНомераТелефонов(СсылкаОбъект)
	
	ТипДокументы=Документы.ТипВсеСсылки();
	ПараметрСсылка="";
	
	ПараметрСсылкаНаОбъект = СсылкаОбъект;
	ПараметрСсылкаФорма = СсылкаОбъект;
	ТипЗначенияОбъекта=ТипЗнч(ПараметрСсылкаНаОбъект);
	
	ЭтоЛид 			= (ТипЗначенияОбъекта = Тип("ДокументСсылка.Лид"));
	ЭтоПользователь = (ТипЗначенияОбъекта = Тип("СправочникСсылка.Пользователи"));
	ЭтоСотрудник 	= (ТипЗначенияОбъекта = Тип("СправочникСсылка.Сотрудники"));	
	ЭтоКонтрагент	= (ТипЗначенияОбъекта = Тип("СправочникСсылка.Контрагенты"));
	
	Если ТипДокументы.СодержитТип(ТипЗначенияОбъекта) Тогда
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Контрагент", СсылкаОбъект.Метаданные()) Тогда
			ПараметрСсылкаФорма = СсылкаОбъект.Контрагент;
			ЭтоКонтрагент = Истина;
		КонецЕсли;		
	КонецЕсли;
	
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПараметрСсылкаФорма);
	
	Если ЭтоЛид Тогда
		
		КонтактЛида = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрСсылкаФорма, "ИмяКлиента");
		КонтактнаяИнформацияОбъектов = УправлениеКонтактнойИнформациейПотолки.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ);
		Для каждого СтрокаКИ из КонтактнаяИнформацияОбъектов Цикл
			Если ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда 
				НоваяСтрока = Список.Добавить();	
				НоваяСтрока.Контакт = Строка(КонтактЛида);
				НоваяСтрока.НомерТелефона = СтрокаКИ.Представление;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
	Если ЭтоКонтрагент Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ПараметрСсылка", ПараметрСсылкаФорма);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактныеЛица.Ссылка
		|ИЗ
		|	Справочник.КонтактныеЛица КАК КонтактныеЛица
		|ГДЕ
		|	КонтактныеЛица.ОбъектВладелец = &ПараметрСсылка";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивОбъектов.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;		
	
	Если ЭтоСотрудник ИЛИ ЭтоПользователь ИЛИ ЭтоКонтрагент Тогда
		КонтактнаяИнформацияОбъектов = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипыКИ);
		Для каждого Контакт из КонтактнаяИнформацияОбъектов Цикл
			Если ЗначениеЗаполнено(Контакт.Представление) Тогда 
				НоваяСтрока = Список.Добавить();	
				НоваяСтрока.Контакт = Строка(ПараметрСсылкаФорма);
				НоваяСтрока.НомерТелефона = Контакт.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ВыборКонтактаЗавершение()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Закрыть(ТекДанные.НомерТелефона);
	 
КонецПроцедуры

#КонецОбласти
